# ExternalResourceUtils Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceUtils Class
Members See Also
---
A utility class containing functions related to external resource references.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public static class ExternalResourceUtils
```

Visual Basic
---
```text
Public NotInheritable Class ExternalResourceUtils
```

Visual C++
---
```text
public ref class ExternalResourceUtils abstract sealed
```

# Remarks
Elements which are external resource references refer to data outside of the base .rvt file. Examples include Revit links and the keynote table data.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ExternalResourceUtils
# See Also
ExternalResourceUtils Members
Autodesk.Revit.DB Namespace